# FamilyPointLocation Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyPointLocation Members
FamilyPointLocation Class Methods Properties See Also
---
The FamilyPointLocation type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLocation | Gets the location of the point. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The name of the corresponding reference point in the Family document. |

# See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace